import { FC, ReactNode } from 'react';
import styles from './main-page-content-mobile.module.css';

import ButtonMobile from '../button/button-mobile';
import ButtonLinkMobile from '../button/button-link-mobile';
import ButtonConnectMobile from '../button/button-connect-mobile';


interface IMainPageContentMobileProps {
  children: ReactNode;
}



const MainPageContentMobile = () => {

  const feedback = '/feedback';
  
  return (
    <main className={styles['main-page-content']}>
      <div className={styles['card-1']}>
        Комплексные решения в сфере ресторанного бизнеса и сегмента HoReCa
      </div>
      <div className={styles['card-2']}>
        <div className={styles['card-2__title']}>
          Что мы делаем?
        </div>
        <div>
          Если честно, мы делаем всё, что душе угодно, но только то, в чем действительно хорошо разбираемся, а именно:
          упаковка для фастфуда, кофеин, пекарен, рекламное оформление, униформу еще мы варим соус и оказываем услугу консалтинга, 
          да-да, напоминаю, делаем, что душе угодно 
        </div>
      </div>
      <div className={styles['card-3']}>
        <div className={styles['card-3__title']}>
          Хотим сразу сказать, что мы не интернет-магазин.
        </div>
        <div className={styles['card-3__text']}>
          Вы вряд ли получите от нас общее КП (для всех) и единый прайс на все позиции. 
          На вопрос: «А сколько стоит 1 шт?» — скорее всего, мы тоже не ответим. 
          Все потому, что..
        </div>
      </div>
      <div className={styles['card-4']}>
        <div>
          <span className={styles['card-4__title']}>Наша сильная сторона</span> — это углубленный маркетинговый подход и поиск индивидуальных решений для каждого клиента 
          с полным погружением в рабочий процесс. 
          Поэтому дизайн/макети штамп - это бесплатно.
        </div>
        <div className={styles['card-4__text']}>
          Ведь каждый выполненный заказ — это монетка счастья в копилочку нашей радости!
        </div>
      </div>
      <div className={styles['card-5']}>
        Мы понимаем как влияют на бизнес узнаваемость, бренд, реклама, маркетинг, формирование цен, а также реализация этих задач. 
        Поэтому сделали сервис, который упростит все решения и даст желаемый результат.
      </div>
      <div className={styles['card-6']}>
        <div className={styles['card-6__text-1']}>
          Что это для нас и почему это важно?
        </div>
        <div className={styles['card-6__text-2']}>
          Френдли — бизнес
        </div>
        <div className={styles['card-6__text-3']}>
          Хотим, чтобы наши взаимодействия были выстроены на доверии, а не на счетах за дополнительные услуги 
          и каждое лишнее действие. Если вы дочитали до этого пункта, то мы уже на полпути к тому, чтобы реализовать ваш запрос с минимальными затратами времени и нервов. 
        </div>
        <div className={styles['card-6__button-connect']}>
          <ButtonConnectMobile link={'/feedback'} text={'Связаться с нами'} />
        </div>
      </div>
      <div className={styles['card-7']}>
        Если у вас есть свой дизайнер, маркетолог и технолог, мы внимательно изучим все их пожелания, ТЗ и комментарии. 
        Если нет — то все сделаем сами.
      </div>
      <div className={styles['card-8']}>
        <div className={styles['card-8__title']}>
          Конечно же лучше один раз увидеть, чем сто раз представить!
        </div>
        <div className={styles['card-8__text']}>
          Воспользуйтесь опцией и визуализируйте свой бренд на представленных упаковочных решениях
          (нажми меня) — открывается фича с визуализацией
        </div>
        <div className={styles['card-8__button-connect']}>
          <ButtonConnectMobile link={'/feedback'} text={'Связаться с нами'} />
        </div>
      </div>
      <div className={styles['card-9']}>
        Если вы не нашли то, что искали, это не означает, что мы этого не можем, не делаем или не предоставляем. 
        Готовы обсудуть новые предложения. Нам всегда можно позвонить или написать. Отвечаем быстро и почти в любое время, а не после «дождичка в четверг»
      </div>
      <div className={styles['card-10']}>
        <div>
         <span className={styles['card-10__color']}>Ес</span>ли после прочитанного вам ничего не понятно, но очень интересно
        </div>
        <div>
          (гипер ссылка на вкладку как мы работаем в подробностях)
        </div>
      </div>
      <svg width="328" height="338" viewBox="0 0 328 338" fill="none" xmlns="http://www.w3.org/2000/svg">
        <ellipse cx="165.509" cy="185.364" rx="154.442" ry="152.636" fill="#CFDEFD"/>
        <path d="M255.774 178.882C212.446 138.316 155.191 159.454 131.979 175.093C105.673 189.082 93.5084 214.339 90.7144 225.218C57.7025 213.328 31.1812 226.481 22.047 234.544C2.4462 251.33 -0.73463 272.624 0.125056 281.172C4.25155 325.469 43.3242 337.514 62.3448 338L274.795 336.543C305.485 334.814 319.073 321.158 324.106 310.688C343.733 261.073 284.359 250.184 253.195 256.692C272.108 247.658 299.102 219.448 255.774 178.882Z" fill="#4547EA"/>
        <path d="M240.193 191.414C200.235 152.715 151.398 176.494 129.992 191.414C105.731 204.758 106.168 228.926 103.591 239.305C73.1465 227.962 42.8419 231.614 34.4182 239.305C16.3418 255.318 13.4084 275.632 14.2012 283.787C18.0068 326.044 54.0405 337.535 71.5816 337.998L267.508 336.608C298.598 334.068 312.203 323.079 316.266 314.368C330.299 256.319 252.245 261.354 223.506 267.562C240.948 258.944 280.151 230.113 240.193 191.414Z" fill="#555DEC" fillOpacity="0.52"/>
        <path d="M59.6167 280.126C50.3358 281.148 55.2126 276.507 58.65 274.059C56.8453 277.891 59.939 278.955 61.8725 278.849C63.722 278.747 66.0618 277.252 68.6398 275.975C65.4173 279.488 62.8392 279.488 59.6167 280.126Z" fill="#90B2F0"/>
        <path d="M78.9519 269.905C73.7958 271.822 73.7958 269.586 73.4736 267.031C66.2551 268.309 60.3686 272.354 58.65 274.057C57.0387 275.654 57.4899 279.103 61.8725 278.847C66.2551 278.592 75.7293 272.46 78.9519 269.905Z" fill="#0A0062"/>
        <path d="M76.0516 240.525C75.7938 238.481 78.0925 235.096 79.2741 233.818C79.9186 236.693 84.1079 237.331 86.0414 237.012C84.2368 240.844 80.778 242.228 79.5964 242.441C78.5222 242.654 76.3094 242.569 76.0516 240.525Z" fill="#90B2F0"/>
        <path d="M92.1642 228.071C91.133 228.071 90.2307 226.475 89.9084 225.836C85.5258 226.858 80.8853 231.691 79.2741 233.82C79.9186 237.333 84.3227 237.652 86.0414 237.333C88.512 234.352 93.1954 228.071 92.1642 228.071Z" fill="#0A0062"/>
        <path d="M112.788 215.617L106.666 210.188L98.9315 184.32L86.3636 183.682C84.7524 187.194 84.7535 187.149 83.7856 190.069L94.0977 220.088H96.6757L96.998 223.281L99.576 220.726L107.31 221.365L139.535 220.088C141.361 222.749 148.107 227.688 159.193 226.155C157.796 228.604 154.359 233.82 148.881 234.778C143.617 235.31 139.213 235.736 130.834 233.5C123.745 230.945 112.788 231.265 106.343 237.652C98.287 245.636 86.6859 267.99 77.3406 270.545C69.8643 272.589 74.87 258.197 78.3073 250.745C80.8853 245.636 87.2659 233.947 92.1642 228.071C90.1018 228.838 86.0414 219.449 84.4301 214.339C81.7111 205.717 81.8734 195.836 83.7856 190.069C84.7535 187.149 84.7524 187.194 86.3636 183.682C88.9416 179.211 92.379 181.02 94.7422 182.085C95.572 182.459 97.6379 183.495 98.9315 184.32C109.345 191.504 128.841 207.752 128.579 208.272C128.321 208.783 125.678 211.146 123.745 211.784C118.331 208.719 114.4 213.062 112.788 215.617Z" fill="#7F98F5"/>
        <path d="M123.423 212.103C128.837 211.847 136.85 196.667 140.18 189.109L143.725 192.303L142.113 204.119C141.469 206.993 137.387 210.223 134.379 212.636C137.789 211.74 139.855 210.657 141.147 209.548L157.581 195.816C162.222 196.838 164.456 202.629 164.993 205.396C163.189 212.55 147.269 216.893 139.535 218.17H110.059L109.414 216.574C111.734 216.829 113.175 215.227 113.755 214.338C116.591 209.995 121.382 211.038 123.423 212.103Z" fill="#FFB9BA"/>
        <path d="M123.423 212.103C128.837 211.847 136.85 196.667 140.18 189.109L143.725 192.303L142.113 204.119C141.469 206.993 137.387 210.223 134.379 212.636M123.423 212.103C121.382 211.038 116.591 209.995 113.755 214.338C113.175 215.227 111.734 216.829 109.414 216.574L110.059 218.17H139.535C147.269 216.893 163.189 212.55 164.993 205.396C164.456 202.629 162.222 196.838 157.581 195.816L141.147 209.548C139.855 210.657 137.789 211.74 134.379 212.636M123.423 212.103C125.227 213.636 129.76 213.38 131.801 213.061C132.67 213.01 133.536 212.858 134.379 212.636" stroke="#FFB1B2" strokeWidth="1.5"/>
        <path d="M137.924 186.235C145.916 170.14 153.929 167.394 156.937 168.032C158.548 170.161 162.866 173.206 168.538 167.074C175.95 168.245 189.742 174.228 184.328 190.067C182.287 196.987 174.339 213.827 158.87 225.835C154.466 226.686 144.498 226.729 139.858 220.086V218.809C147.269 217.851 161.448 212.805 165.315 205.396C164.623 202.948 162.061 197.54 157.349 195.496C152.296 200.675 144.987 205.977 141.147 208.59L144.047 191.984L137.924 186.235Z" fill="#FF7165"/>
        <path d="M144.047 191.984L137.924 186.235C145.916 170.14 153.929 167.394 156.937 168.032C158.548 170.161 162.866 173.206 168.538 167.074C175.95 168.245 189.742 174.228 184.328 190.067C182.287 196.987 174.339 213.827 158.87 225.835C154.466 226.686 144.498 226.729 139.858 220.086V218.809C147.269 217.851 161.448 212.805 165.315 205.396C164.623 202.948 162.061 197.54 157.349 195.496M144.047 191.984L141.147 208.59C144.987 205.977 152.296 200.675 157.349 195.496M144.047 191.984C143.832 189.642 143.918 183.936 145.98 179.848M166.282 181.764C165.441 186.053 161.764 190.972 157.349 195.496" stroke="#F5675B" strokeWidth="1.5"/>
        <path d="M153.714 142.484C157.904 140.142 169.44 139.546 167.893 155.897C163.288 161.602 159.552 163.562 156.615 163.357C151.659 163.012 148.978 156.506 148.236 151.426C147.958 149.893 150.806 144.613 153.714 142.484Z" fill="#FFB9BA"/>
        <path d="M155.648 147.913C161.062 142.293 161.8 146.529 162.014 149.829C162.137 150.851 163.626 151.107 163.948 150.149L164.671 148.233C165.315 146.636 166.961 147.487 167.249 148.233C168.28 149.254 166.253 151.745 165.96 153.342C165.444 156.152 167.464 156.216 168.538 155.897C170.085 155.386 170.364 151.852 170.149 150.468C169.634 147.147 172.405 145.678 173.05 143.123C174.339 139.035 172.083 138.439 170.794 138.652C168.474 139.674 167.894 138.865 167.894 138.333C167.12 132.712 162.093 132.584 159.515 133.223C156.937 134.181 158.226 137.375 155.97 136.417C150.299 131.818 147.269 135.778 147.592 139.291C147.592 141.526 146.303 141.207 144.691 141.526C135.668 144.081 145.336 152.065 149.847 150.787C153.457 149.765 155.218 148.445 155.648 147.913Z" fill="#222222" stroke="#222222"/>
        <path d="M98.9315 184.638L81.8521 183.68L94.0977 220.086L109.566 221.363L139.213 220.086V218.489C129.545 218.702 110.081 218.808 109.566 218.808C109.05 218.808 102.261 196.028 98.9315 184.638Z" fill="#0F0776" stroke="#0F0776"/>
        <rect x="166.012" y="95.0586" width="11.0675" height="11.8824" rx="2" fill="#F5DF4D"/>
        <rect x="196.196" y="59.4766" width="14.0859" height="15.8432" rx="2" fill="#F5DF4D"/>
        <rect x="243.485" y="6.16406" width="20.1227" height="21.7844" rx="2" fill="#F5DF4D"/>
        <rect x="171.743" y="92.2937" width="8.66134" height="8.50198" rx="2.3" stroke="#939597" strokeWidth="1.4"/>
        <rect x="203.368" y="56.2512" width="11.1444" height="10.9425" rx="2.2" stroke="#939597" strokeWidth="1.6"/>
        <rect x="253.74" y="1.2" width="15.7104" height="15.4236" rx="1.8" stroke="#939597" strokeWidth="2.4"/>
      </svg>
    </main>
  );
};

export default MainPageContentMobile;